<script setup lang="ts">
const store = useMainStore()
onKeyStroke('Escape', (e) => {
  e.preventDefault()
  store.faqModal = false
})
function close() {
  store.faqModal = false
}
</script>

<template>
  <input id="faqModal" type="checkbox" class="modal-toggle">
  <div
    :class="{
      'modal-open': store.faqModal,
    }"
    class="modal"
  >
    <div class="modal-box w-6/12 max-w-4xl">
      <label
        for="review-modal" class="btn btn-sm btn-circle absolute right-2 top-2 btn-ghost"
        @click="close"
      >✕</label>
      <h1 class="text-xl font-bold">
        Часто задаваемые вопросы
      </h1>
      <div class="mt-4 overflow-auto flex flex-col gap-4">
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Ошибка пополнения баланса, что делать?
          </h3>
          <p>
            Чтобы пополнить баланс, выполните простые рекомендации:

            <ul>
              <li>
                1. Пришлите нам свой никнейм/почту от кабинета
              </li>
              <li>
                2. Пришлите точную сумму пополнения
              </li>
              <li>
                3. Пришлите скриншот чека транзакции
              </li>
            </ul>

            В течение 24 часов с момента поступления заявки рассмотрим, проверим и начислим на ваш баланс.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Как пополнять баланс платформы с СПП или без?
          </h3>
          <p>
            Пополнение баланса БЕЗ СПП.
          </p>
          <p>
            Каждый день Wildberries изменяет % скидки. Отслеживать и изучать данный вопрос слишком затратен по времени и средствам.
          </p>
          <p>
            Поэтому, вы пополняете ваш баланс БЕЗ СПП, но выкуп происходит с СПП.
          </p>
          <p>
            Все платежи вы сможете отслеживать в меню История платежей.
          </p>

          <p>
            Обратите внимание!
            Все денежные средства, которые вы начисляете принадлежат только вам.
          </p>
          <p>
            Мы не имеем к ним доступа и не занимаемся мошенничеством, т.к. для нас важно наше Имя и Репутация на рынке.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Как пополнить баланс платформы, если выделили бюджет с СПП и ценой за выкуп?
          </h3>
          <p>
            Наш финансовый распределитель рассчитывает сумму пополнения баланса БЕЗ СПП.
          </p>
          <p>
            Если в вашем бюджете есть рамки от и до, то рекомендуем пополнять баланс на выделенную сумму.
          </p>
          <p>
            Затем, создайте сперва 80-85% выкупов, после оставшиеся 15-20% доделать спустя некоторое время.
          </p>
          <p>
            Так ваши выкупы не будут уходить в Архив, а вам не нужно будет лишний раз заходить на платформу.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Нужны коды для ДДС (чек оплаты товара для фин отчета), что делать?
          </h3>
          <p>
            Данный формат выгрузки данных по оплаченным товарам, не доступен
          </p>
          <p>
            Вы можете изучить все финансовые операции внутри нашей платформы:
          </p>
          <ul>
            <li>
              1. Перейдите в Историю платежей
            </li>
            <li>
              2. Выберите нужную Сортировку
            </li>
            <li>
              3. Нажмите кнопку Экспорт
            </li>
            <li>
              4. Выберите диапазон дат
            </li>
            <li>
              5. Скачайте Excel-таблицу
            </li>
            <li>
              6. Изучите данные внутри Excel-таблицы
            </li>
          </ul>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Условия связки бидер + выкупы, что делать?
          </h3>
          <p>
            Чтобы запустить данную связку в дело, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Запустите Рекламную кампанию
            </li>
            <li>
              2. Скопируйте ключевики РК (* рекламная кампания)
            </li>
            <li>
              3. Создайте выкупы с одинаковыми ключевиками
            </li>
            <li>
              4. Выберите в Правилах “Выкуп с рекламы” (см. правило 8-9)
            </li>
            <li>
              5. Запустите выкупы с рекламы
            </li>
          </ul>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Выкуп в Архиве, что делать?
          </h3>
          <p>
            Чтобы узнать причину выкупа в Архиве, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Перейдите в меню Выкупы
            </li>
            <li>
              2. Найдите ваш выкуп
            </li>
            <li>
              3. Нажмите 3 точки (правый верхний угол окна)
            </li>
            <li>
              4. Выберите раздел Инфо о выкупе
            </li>
            <li>
              5. Изучите детали Архивации вашего выкупа
            </li>
          </ul>
          <p>
            Причины ухода в Архив разные: по ключевикам, недостаток на балансе, загруженность ПВЗ с платной доставкой в 200 руб, не нахождении в рекламе или по сортировкам, загруженность серверов Вб и необработка наших запросов и т.д.
          </p>
          <p>
            Если у вас возникла какая-то причина, неизвестная нам, присылайте, мы посмотрим и подскажем, что делать
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Сделали отказ от товара на ПВЗ, что делать?
          </h3>
          <p>
            У нас запрещено делать Отказы, т.к. данная процедура не автоматизированна и ее приходиться делать РУЧКАМИ, а это трудоемко и не эффективно.
          </p>
          <p>
            Лучше сами купите товар конкурента и попробуйте продукт, а не проводите манипуляции с ним.
          </p>
          <p>
            Если вы сделали отказ от выкупа, выполните простые рекомндации:
          </p>

          <ul>
            <li>
              1. Пришлите мне ID выкупа
            </li>
            <li>
              2. Пришлите мне ваш никнейм/почту от кабинета
            </li>
          </ul>
          <p>
            Данная процедура на данный момент не делается быстро, задача будет поставлена, но сроки на исполнение отсутствуют.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            На ПВЗ указывает неверный Qr, что делать?
          </h3>
          <p>
            Чтобы забрать товар с ПВЗ, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Перейдите в меню Доставка
            </li>
            <li>
              2. Нажмите Экспорт
            </li>
            <li>
              3. Выберите удобный для вас способ выгрузки данных
            </li>
            <li>
              4. Скачайте и изучите файл
            </li>
            <li>
              5. Отправьте курьеру или фулфилмент центру
            </li>
          </ul>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Создан выкуп на платформе и пополнен баланс, как будет сделан выкуп?
          </h3>
          <p>
            Выкуп делается автоматически без вашего прямого участия.
          </p>
          <p>
            Чтобы запустить выкупы в работу, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Подготовьте материалы для создания выкупов (скачайте наш Excel-шаблон в меню Выкупы)
            </li>
            <li>
              2. Рассчитайте бюджет выкупов “без или с” СПП
            </li>
            <li>
              3. Создайте выкупы на платформе в нужно кол-ве
            </li>
            <li>
              4. Пополните баланс на платформе
            </li>
          </ul>
          <p>
            Учитывайте, что 15-20% выкупов уйдут в Архив по причин недостатка на балансе. Вам нужно их будет просто Возобновить или Вернуть с Архива для активации.
          </p>
          <p>
            После чего, все выкупы автоматически произойдут без вашего прямого участия.
          </p>
          <p>
            Создавать выкупы вы можете на недели или месяцы вперед.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Платные ПВЗ, что делать?
          </h3>
          <p>
            Если ваш выкуп ушел в Архив по причине платного ПВЗ, рекомендуем пересоздать выкуп на другой ПВЗ.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Не выкупает товар, что делать?
          </h3>

          <p>
            Чтобы узнать причину, почему ваш товар не выкупается, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Перейдите в меню Выкупы
            </li>
            <li>
              2. Найдите ваш выкуп
            </li>
            <li>
              3. Нажмите 3 точки (правый верхний угол)
            </li>
            <li>
              4. Нажмите раздел Инфо о выкупе
            </li>
            <li>
              5. Изучите актуальную причину Архивации
            </li>
          </ul>
          <p>
            Причины ухода в Архив разные: по ключевикам, недостаток на балансе, загруженность ПВЗ с платной доставкой в 200 руб, не нахождении в рекламе или по сортировкам, загруженность серверов Вб и необработка наших запросов и т.д.
          </p>
          <p>
            Если у вас возникла какая-то причина, неизвестная нам, присылайте, мы посмотрим и подскажем, что делать.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Выкуп на Паузе, что делать?
          </h3>
          <p>
            Если ваш выкуп ушел на Паузе, нажмите кнопку Возобновить.
          </p>
          <p>
            Причина - недостаток средств на балансе.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Выкуп Завершен, где отследить транзакции?
          </h3>
          <p>
            После того как мы выкупим ваш товар, рекомендуем перейти в меню Доставка для отслеживания процесса доставки на ПВЗ.
          </p>
          <p>
            Также перейдите в меню Истории платежей, чтобы отследить транзакцию для фиксации в Финансовом отчете.
          </p>
          <p>
            Чтобы изучить детализацию пути выкупа, перейдите в меню Отчеты по выкупам и откройте желаемый Отчет.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Вывод средств с баланса, что делать?
          </h3>
          <p>
            Если вы хотите вывести средства с баланса, то данная услуга пока недоступна в связи с правилами QIWI.
          </p>
          <p>
            Мы можем совершить вывод на ИП/ООО ваше, но все комиссии оплачиваете вы при выводе.
          </p>
          <p>
            В дальнейшем мы придумаем альтернативное и простое решение для вас и всех наших клиентов.
          </p>
        </div>
        <div class="flex flex-col gap-2">
          <h3 class="font-bold text-lg">
            Как порекомендовать вашу платформу?
          </h3>
          <p>
            Чтобы порекомендовать нашу платформу вашему окружению, выполните простые рекомендации:
          </p>
          <ul>
            <li>
              1. Перейдите в меню Партнерская программа
            </li>
            <li>
              2. Скопируйте вашу реферальную ссылку
            </li>
            <li>
              3. Отправьте вашему окружению ссылку
            </li>
            <li>
              4. Отслеживайте регистрацию рефералов
            </li>
          </ul>
        </div>
      </div>
    </div>

    <label class="modal-backdrop" for="faqModal" @click="close">Close</label>
  </div>
</template>

<style scoped>

</style>
